hdscmcu/pack/HDSC.HC32F448.pdsc
        <condition id = "HC32F448FCUI">
            <require Dname="HC32F448FCUI"/>
        </condition>
        <condition id = "HC32F448FAUI">
            <require Dname="HC32F448FAUI"/>
        </condition>
        <!-- Device + CMSIS Conditions -->
        <condition id="HC32F448 CMSIS">
            <description>HDSC HC32F448 Series devices and CMSIS-CORE</description>
            <require condition="HC32F448"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
    </conditions>

    <components>
    <!-- Startup HC32F448 -->
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="HC32F448 CMSIS">
            <description>System Startup for HC32F448 series</description>
            <RTE_Components_h>
            <!-- the following content goes into file 'RTE_Components.h' -->
            <!--#define RTE_DEVICE_STARTUP_HC32F448    /* Device Startup for HC32F448 */-->
            </RTE_Components_h>

            <files>
                <!-- include folder -->
                <file category="include" name="Device/Include/"/>
                <file category="header" name="Device/Include/HC32F448.h"/>
                <file category="header" name="Device/Include/HC32F448FAUI.h" condition="HC32F448FAUI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448FCUI.h" condition="HC32F448FCUI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448JATI.h" condition="HC32F448JATI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448JAUI.h" condition="HC32F448JAUI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448JCTI.h" condition="HC32F448JCTI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448JCUI.h" condition="HC32F448JCUI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448KATI.h" condition="HC32F448KATI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448KCTI.h" condition="HC32F448KCTI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448MATI.h" condition="HC32F448MATI" attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/HC32F448MCTI.h" condition="HC32F448MCTI" attr="config" version="1.0.0"/>
                <!-- startup file -->
                <file category="source" name="Device/Source/ARM/startup_hc32f448.s" attr="config" version="1.0.0" condition="Compiler ARM"/>
                <file category="source" name="Device/Source/IAR/startup_hc32f448.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
                <!-- system file -->
                <file category="source" name="Device/Source/system_hc32f448.c"  attr="config" version="1.0.0"/>
                <file category="header" name="Device/Include/system_hc32f448.h" attr="config" version="1.0.0"/>
                <!-- example file -->
                <file category="source"  name="Examples/EmptyMain/main.c" attr="template" select="Empty C main" version="1.0.0"/>
            </files>
        </component>
    </components>

    <boards>
        <board vendor="HDSC" name="EV_F448_LQ80_Rev1.0">
            <description>HC32F448 80-Pin Target board</description>
            <mountedDevice    deviceIndex="0" Dvendor="HDSC:145" Dname="HC32F448MATI"/>
            <compatibleDevice deviceIndex="0" Dvendor="HDSC:145" Dfamily="HC32F448-Series" DsubFamily="HC32F448"/>
            <debugInterface adapter="JTAG/SW" connector="CMSIS_DAP Debug Connector (MicroUSB connector)"/>
        </board>
    </boards>


    <examples>
        <example name="EmptyMain" folder="Examples/EmptyMain" doc="Abstract.txt" version="1.0.0">
        <description>This is a basic example providing an empty main body</description>
        <board name="EV_F448_LQ80_Rev1.0" vendor="HDSC"/>
        <project>
            <environment name="uv"  load="ARM/EmptyMain.uvprojx"/>
            <environment name="iar" load="IAR/EmptyMain/EmptyMain.ewp" />
        </project>
        <attributes>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <keyword>Empty</keyword>
            <keyword>Main</keyword>
            <keyword>Getting Started</keyword>
        </attributes>
        </example>
    </examples>


</package>
